Revit 2027 API
BuiltInFailures.SheetFailures.SheetNumberDuplicatedPerSheetCollection Property
 Sheet Number is already in use. The same Sheet Number value can be used once for all sheets directly in the model, and once for all sheets per Sheet Collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SheetNumberDuplicatedPerSheetCollection { get; }
Public Shared ReadOnly Property SheetNumberDuplicatedPerSheetCollection As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SheetNumberDuplicatedPerSheetCollection {
	FailureDefinitionId^ get ();
}
static member SheetNumberDuplicatedPerSheetCollection : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SheetFailures Class
Autodesk.Revit.DB Namespace